seller side payment settlement system - diagrams ++
